import type { NextPage } from "next";

const Privacy: NextPage = () => {
  return (
    <div className="px-20 pt-6 pb-12">
      <h1 className="font-bold text-lg mb-4">
        Положение об обработке и защите персональных данных
      </h1>

      <h2 className="text-lg mb-4">Содержание</h2>

      <ol className="mb-4 text-sm space-y-2 list-decimal pl-8 [&_li]:pl-2">
        <li>Общие положения и область применения.</li>
        <li>Состав и содержание персональных данных.</li>
        <li>Цель, границы и сроки обработки персональных данных.</li>
        <li>Местонахождение персональных данных.</li>
        <li>
          Условия раскрытия информации о персональных данных третьим лицам.
        </li>
        <li>Защита персональных данных.</li>
        <li>Права Пользователя (субъекта персональных данных).</li>
        <li>
          Порядок работы с запросами субъектов персональных данных
          (пользователей).
        </li>
        <li>Внесение изменений в Положение.</li>
      </ol>

      <ol className="text-sm space-y-2 list-decimal pl-8 [&_li]:pl-2">
        <li>
          <p className="mb-3 font-bold text-sm">
            Общие положения и область применения.
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Это Положение об обработке и защите персональных данных (далее –
              «Положение») разработано ООО «Розетка. УА» (код ЕГРПОУ: 37193071,
              адрес: г. Киев, бул. Дружбы Народов, 8А, в дальнейшем – «Общество»
              и/или «Владелец данных») в соответствии с действующим
              законодательством Украины, в том числе, но не исключительно,
              Закона Украины «О защите персональных данных» от 01 июня 2010 года
              № 2297-VI и устанавливает порядок получения, сбора, накопления,
              хранения, обработки, использования, обеспечения защиты и раскрытия
              персональных данных (далее – «Данные» и/или «Персональные данные»)
              с помощью веб-сайта: rozetka.com.ua (далее – «Сайт») и/или
              мобильного приложения: “ROZETKA” (далее – «Мобильное приложение»
              и/или «Мобильное приложение “ROZETKA”) и/или связанных с ними
              услуг и инструментов.
            </li>
            <li>
              Осуществив регистрацию на Сайте rozetka.com.ua или авторизацию с
              помощью мобильного приложения “ROZETKA” (загруженный с помощью
              Play Market и App Store), начиная с использования
              Интернет-магазина, или при попытке оформить заказ без
              предварительной регистрации, Пользователь (Покупатель)
              предоставляет разрешение и однозначное согласие на обработку его
              персональных данных на условиях и в порядке, изложенных ниже, а
              также подтверждает ознакомление с настоящим Положением, его
              принятие и согласие с его содержанием.
            </li>
            <li>
              Под онлайн-платформой Rozetka в настоящем Положении
              подразумеваются Сайт и Мобильное приложение вместе, которые вместе
              используются как «Интернет-магазин» и/или «Онлайн-платформа
              Rozetka» и/или «Онлайн-платформа».
              <br />
              Под Пользователем (Покупателем, потребителем) в настоящем
              Положении подразумевается любое физическое и/или юридическое лицо,
              имеющее доступ к Интернет-магазину и использующее его
              функциональность и сервисы.
            </li>
            <li>
              Владельцем персональных данных Пользователей является ООО
              «Розетка. УА» (код ЕГРПОУ: 37193071, адрес: г. Киев, бул. Дружбы
              Народов, 8А).
            </li>
            <li>
              В настоящем Положении все термины используются в значении,
              определенном в Законе Украины «О защите персональных данных» от 01
              июня 2010 г. № 2297-VI.
            </li>
            <li>
              На сайте могут быть ссылки на другие веб-сайты (исключительно в
              информационных целях). При переходе по ссылке на другие веб-сайты
              действие этого Положения на такие сайты не будет распространяться.
              В связи с чем Общество рекомендует ознакомиться с политикой в
              сфере конфиденциальности и персональных данных каждого сайта перед
              тем, как передавать персональные данные, по которым Вы можете быть
              идентифицированы.
              <br />
              Настоящее Положение обязательно для применения ответственным лицом
              и сотрудниками Интернет-магазина, непосредственно осуществляющими
              обработку и/или имеющими доступ к персональным данным в связи с
              исполнением своих служебных обязанностей.
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Состав и содержание персональных данных.
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Под Данными понимается любая информация, прямо или косвенно
              относящаяся к конкретному Пользователю. Это может быть:
              <br />
              имя, фамилия, отчество (в случае наличия), номер телефона, адрес
              электронной почты, дата рождения, наличие детей, пол, увлечения,
              наличие домашних животных, наличие автомобиля и его VIN-номер,
              язык общения, адрес места жительства/нахождения/доставки,
              информация о действиях Пользователя при использовании
              Интернет-магазина, IP-адреса, данные об устройствах, используемых
              Пользователем (тип устройства, тип браузера, операционная система
              устройства), история сообщений (информация, содержащаяся в
              переписке между Пользователем с администрацией Интернет-магазина
              или со сторонними продавцами маркетплейса), история отзывов или
              комментариев, другая информация, с помощью которой осуществляется
              коммуникация, и которая по желанию Пользователя предоставляется им
              в регистрационной форме и/или при заполнении собственного профиля
              в Интернет-магазине, при прохождении опроса (путем заполнения
              анкеты или другим способом), или информация получена при устной
              коммуникации Пользователя и администрации Сайта, информация,
              предоставляемая при осуществлении оплаты в Интернет-магазине (в
              том числе при покупке товаров и/или услуг, которые предлагаются в
              Интернет-магазине в кредит/оплату частями. В частности: информация
              о паспортных данных Пользователя, идентификационном коде и др.).
              <br />
              Данный перечень персональных данных не является постоянным и
              обязательным для всех Пользователей, а зависит от потребностей и
              желаний самого Пользователя и от тех операций, которые он/она
              выполняет в Интернет-магазине.
              <br />
              Под Данными также понимается другая информация, полученная
              Интернет-магазином на законных основаниях от третьих лиц и/или
              доступная из профайлов Пользователя в социальных сетях – в случае
              регистрации в Интернет-магазине с помощью служб аутентификации
              социальных сетей. В таком случае Пользователь предоставляет свое
              согласие на обработку информации, доступной из соответствующих
              аккаунтов (профайлов) в социальных сетях.
            </li>
            <li>
              Пользователи несут ответственность за всю информацию, размещаемую
              ими в общедоступных аккаунтах. Пользователь должен осознать все
              риски, связанные с тем, что он обнародует адрес или информацию о
              своем точном местоположении. Если Пользователь решил войти на
              онлайн платформу, используя службу аутентификации стороннего
              оператора, например информацию Facebook, Общество может получить
              дополнительный профиль или другую информацию, доступ к которой
              предоставлен таким третьим лицом.
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Цель, границы и сроки обработки персональных данных.
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Целью обработки персональных данных является:
              <ol className="text-sm space-y-2 list-decimal pl-8">
                <li>
                  обеспечение реализации гражданско-правовых отношений,
                  хозяйственных, налоговых отношений, осуществление возложенных
                  на Общество функций, полномочий и обязанностей в соответствии
                  с действующим законодательством Украины;
                </li>
                <li>
                  идентификации клиента как Пользователя Интернет-магазина, для
                  связи с Пользователем в том числе для предоставления услуг,
                  обработки платежей, отправки, проведения расчетных операций,
                  предоставления отчетности, ведения бухгалтерского и
                  управленческого учета, создания и реализации бонусных
                  программ, программ лояльности, отправки рассылок по почте,
                  электронной почте, по номеру телефона, в том числе с целью
                  отправки коммерческих предложений, сообщений об акциях и
                  новостях Интернет-магазина, и/или для предоставления
                  Пользователям Интернет-магазина финансовых услуг
                  (предоставляемых третьими лицами и/или партнерами Общества), с
                  целью улучшения качества товаров/оказания услуг, формирования
                  рейтингов товаров и предложений Интернет-магазина, анализа
                  активности Пользователей, осуществления поиска по ключевым
                  словам, управления трафиком в Интернет-магазине, анализа и
                  прогнозирования предпочтений, интересов Пользователей для
                  формирования наиболее релевантных и выгодных персональных
                  предложений или акционных предложений; проведение
                  научно-исследовательской и аналитической активности, отправка
                  информационных и маркетинговых рассылок (новости, акции
                  компании, информацию об акциях, промокодах и скидках,
                  персональные рекомендации, персональные скидки и предложения),
                  содержащие информацию о товарах и/или услугах, рекламные и
                  коммерческие предложения по таким товарам и/или услугам и др.;
                </li>
                <li>
                  с целью отправки рассылок, коммерческих предложений, сообщений
                  об акциях, программы лояльности, бонусные программы и/или с
                  целью отправки сообщений о функционировании Интернет-магазина
                  по почте, электронной почте, по номеру телефона, путем
                  отправки информационных сообщений и уведомлений в Мобильном
                  приложении. Пользователь может в любой момент отказаться от
                  получения информационных и маркетинговых рассылок – через
                  соответствующие настройки на Сайте ;
                </li>
                <li>
                  с целью выполнения других обязанностей, возложенных законом на
                  Владельца персональных данных, для защиты законных интересов
                  владельца персональных данных или третьего лица, которому
                  передаются персональные данные.
                </li>
              </ol>
            </li>
            <li>
              Общество не осуществляет обработку данных, относящихся к расовой,
              национальной принадлежности, политическим взглядам, религиозным и
              другим убеждениям, членству в общественных организациях.
              Информация, характеризующая физиологические особенности
              пользователей, на основе которых можно установить их личность, не
              обрабатываются также.
              <br /> Обработка персональных данных ограничивается сбором
              минимального объема обязательной информации, необходимого
              исключительно для выполнения запроса Пользователя. В любом случае
              при запросе необязательной к предоставлению информации,
              Пользователю сообщается об этом в момент сбора такой информации.
              Не обязательная к предоставлению информация предоставляется
              Пользователем по собственному желанию и по собственному
              волеизъявлению. Компания использует эту информацию для целей
              усовершенствования онлайн-платформы, своих услуг, предоставления
              Пользователю предложений, в зависимости от их предпочтений и
              основываясь на предоставленной Пользователем не обязательной
              информации.
            </li>
            <li>
              Сроки обработки и хранения данных определяются исходя из целей
              обработки данных, а также исходя из условий, указанных в
              договорах, заключенных с Пользователями в соответствии с
              требованиями действующего законодательства Украины. Персональные
              данные обрабатываются и сохраняются настолько долго, насколько это
              необходимо для достижения целей, ради которых они были собраны, в
              том числе для выполнения любых юридических, бухгалтерских
              требований или требований по отчетности или до момента удаления
              данных Пользователем или по запросу Пользователя.
            </li>
            <li>
              Пользователи в любой момент могут изменить/удалить личную
              информацию или отказаться от рассылки сообщений или отозвать
              согласие на обработку данных. Это можно сделать в своем Личном
              кабинете или путем отправки сообщения на электронный адрес:
              cab@rozetka.com.ua с пометкой в теме письма «Персональные данные».
              Удаление учетной записи (аккаунта) по инициативе пользователя
              осуществляется в порядке, определенном в Пользовательском
              соглашении и в Условиях использования Сайта.
              <br /> В случае отсутствия активности в аккаунте Пользователя в
              течение срока, превышающего 5 (пять) лет, Общество оставляет за
              собой право удалить аккаунт Пользователя, включая все личные
              данные, хранящиеся в аккаунте, что означает, что вы больше не
              сможете получить к нему доступ и использовать его.
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Местонахождение персональных данных.
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Персональные данные Пользователей Интернет-магазина обрабатываются
              и защищаются на защищенных серверах Общества.
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Условия раскрытия информации о персональных данных третьим лицам.
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Общество может осуществлять обмен данными с аффилированными лицами
              Общества (компании, действующие на основании общей собственности),
              которые могут обрабатывать и использовать данные с целью,
              определенной настоящим Положением.
            </li>
            <li>
              Раскрытие данных происходит при заказе Пользователем товаров/услуг
              в Интернет-магазине продавцам таких товаров, услуг в объеме,
              необходимом для идентификации Пользователя, выполнения и обработки
              заказа Пользователя (в том числе с целью надлежащего осуществления
              расчетов за товары/услуги, обеспечения получения Пользователем
              финансовых услуг и т.п.).
            </li>
            <li>
              Общество может привлекать сторонних поставщиков товаров/услуг для
              выполнения заказа, в таких случаях такие сторонние поставщики
              товаров/услуг не имеют полномочий использовать полученные с
              помощью онлайн-платформы персональные данные, иначе чем для
              выполнения Заказа.
            </li>
            <li>
              Общество может передавать определенную обезличенную информацию, а
              также предоставлять разрешение на сбор такой деперсонализированной
              информации непосредственно на интернет-сайте с помощью
              соответствующих технологий (данные, не позволяющие
              идентифицировать Пользователей отдельно) сторонним поставщикам
              услуг, доверенным партнерам или авторизованным исследователям с
              целью проведения маркетинговых исследований, улучшения
              результативности рекламных предложений и кампаний (путем
              предложения более релевантных предложений интернет-магазина),
              аналитической деятельности, лучшего понимания, какая реклама,
              товары и/или услуги могут заинтересовать Пользователей, улучшения
              общего качества и эффективности товаров/услуг на онлайн платформе
              и т. п.
            </li>
            <li>
              Общество также может осуществлять обмен данными с поставщиками
              товаров/услуг при проведении на онлайн-платформе конкурсов, промо
              и акций с целью надлежащего обеспечения проведения таких
              конкурсов, промо и акций. В таком случае данные используются и
              могут передаваться третьим лицам для целей и с целью проведения
              таких конкурсов, промо и акций, определения победителя. В случае
              выигрыша/победы, если конкурсы, промо и акции проводятся
              поставщиками товаров/услуг, такие поставщики товаров/услуг могут
              самостоятельно контактировать с Пользователями по вопросам
              проведения конкурсов, промо и акций, определения победителей,
              оформления выигрыша и т.д.
            </li>
            <li>
              Общество осуществляет обработку данных на законной и справедливой
              основе: Данные не раскрываются третьим лицам и не распространяются
              без согласия Пользователя, за исключением случаев, предусмотренных
              действующим законодательством Украины и только в интересах
              национальной безопасности, экономического благополучия и прав
              человека, в частности, но не исключительно:
              <ol className="text-sm space-y-2 list-decimal pl-8">
                <li>
                  по обоснованным запросам органов государственной власти,
                  имеющих право истребовать и получать такие данные;
                </li>
                <li>
                  для целей борьбы с мошенничеством и злоупотреблениями на
                  онлайн-платформе.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">Защита персональных данных.</p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Владелец персональных данных оборудован системными и
              программно-техническими средствами и средствами связи, которые
              предотвращают потери, кражи, несанкционированное уничтожение,
              искривление, подделку, копирование информации и отвечают
              требованиям международных и национальных стандартов.
            </li>
            <li>
              Работники/уполномоченные лица, непосредственно осуществляющие
              обработку и/или имеющие доступ к персональным данным в связи с
              исполнением своих служебных (трудовых) обязанностей обязаны
              соблюдать требования законодательства Украины в сфере защиты
              персональных данных и внутренних документов об обработке и защите
              персональных данных.
            </li>
            <li>
              Работники/уполномоченные лица, имеющие доступ к персональным
              данным, в том числе, осуществляющие их обработку, обязаны не
              допускать разглашения любым способом персональных данных, которые
              были им доверены или стали известны в связи с выполнением
              профессиональных или служебных либо трудовых обязанностей. Такое
              обязательство действует после прекращения ими деятельности,
              связанной с персональными данными, кроме случаев, установленных
              законом.
            </li>
            <li>
              Персональные данные не должны храниться дольше, чем это необходимо
              для целей, для которых такие данные хранятся, но в любом случае не
              дольше срока хранения данных, определенного этим Положением по
              согласию Пользователя.
            </li>
            <li>
              Для целей защиты аккаунтов Пользователей и их персональных данных
              от неправомерного доступа, используется дополнительно
              двухфакторная аутентификация, являющаяся дополнительным уровнем
              защиты аккаунта пользователя.
            </li>
            <li>
              Двухфакторная аутентификация активируется, если в аккаунте
              пользователя имеется подтвержденный номер телефона и выполняется
              хотя бы одно из условий, указанных ниже:
              <ol className="text-sm space-y-2 list-decimal pl-8">
                <li>в аккаунте есть подтвержденный номер телефона;</li>
                <li>к аккаунту привязана банковская карта;</li>
                <li>на балансе аккаунта есть доступные бонусы;</li>
                <li>
                  в аккаунте заполнена кредитная анкета (заполняется в случаях,
                  когда Пользователь желает приобрести товар в кредит).
                </li>
              </ol>
            </li>
            <li>
              При авторизации пользователя с неизвестного устройства срабатывает
              двухфакторная аутентификация. Поэтому, кроме ввода пароля,
              необходимо также ввести одноразовый 6-значный код, который
              поступает на телефон Пользователя в виде SMS или Viber-сообщения
              или происходит дополнительная проверка доверенных устройств
              (идентификатор верифицированного устройства/приложения). В этом же
              сообщении содержится информация о параметрах входа в его/ее
              аккаунт:
              <ol className="text-sm space-y-2 list-decimal pl-8">
                <li>дата попытки авторизации</li>
                <li>IP устройства</li>
                <li>тип клиентского браузера</li>
              </ol>
            </li>
            <li>
              В некоторых случаях, например, если Пользователь выполнил слишком
              много неудачных попыток авторизации, срабатывает дополнительный
              алгоритм защиты – ввод reCaptcha (для проверки, не является ли
              пользователь роботом).
            </li>
            <li>
              В настоящем Положении зафиксированы внутренние политики и
              процедуры по сбору, обработке, использованию, раскрытию личной
              информации или персональных данных при использовании веб-сайта
              https://rozetka.com.ua/ или мобильного приложения Rozetka.
              Владельцем данных разработаны и внедрены внутренние правила по
              работе с персональными данными, включающие процедуру удаления ряда
              данных после удаления личного кабинета Пользователя, уровни
              доступа внутренних сотрудников Общества к данным Пользователей,
              безопасный порядок обмена такими данными внутри Общества. Общество
              на постоянной основе проводит аудит своих систем безопасности с
              целью выявления возможностей для улучшения безопасного хранения и
              использования данных Пользователей. Также Общество соблюдает
              требования Типового порядка обработки персональных данных,
              утвержденного указом Верховной Рады Украины 08.01.2014 № 1/02-14
              (по ссылке) в той мере, в какой это касается именно персональных
              данных.
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Права пользователя (субъекта персональных данных).
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Субъект персональных данных (Пользователь) имеет право:
              <ol className="text-sm space-y-2 list-decimal pl-8">
                <li>
                  знать о местонахождении персональных данных, содержащей его
                  персональные данные, ее назначении и наименовании,
                  местонахождении и/или местожительстве (нахождении) владельца
                  или распорядителя или дать соответствующее поручение по
                  получению этой информации уполномоченным им лицам, кроме
                  случаев, установленных законом;
                </li>
                <li>
                  получать информацию об условиях предоставления доступа к
                  персональным данным, в частности, информацию о третьих лицах,
                  которым передаются его персональные данные;
                </li>
                <li>на доступ к своим персональным данным;</li>
                <li>
                  управлять процедурой отправки сообщений через соответствующие
                  настройки на онлайн-платформе.
                </li>
                <li>
                  получать не позднее чем за тридцать календарных дней со дня
                  поступления запроса, кроме случаев, предусмотренных законом,
                  ответ о том, хранятся ли его персональные данные, а также
                  получать содержание его хранимых персональных данных;
                </li>
                <li>
                  предъявлять мотивированное требование с возражением против
                  обработки своих персональных данных органами государственной
                  власти, органами местного самоуправления при осуществлении их
                  полномочий, предусмотренных законом;
                </li>
                <li>
                  предъявлять мотивированное требование об изменении или
                  уничтожении своих персональных данных любым владельцем и
                  распорядителем, если эти данные обрабатываются незаконно или
                  недостоверны;
                </li>
                <li>
                  на защиту своих персональных данных от незаконной обработки и
                  случайной потери, уничтожения, повреждения в связи с
                  умышленным сокрытием, непредоставлением или несвоевременным их
                  предоставлением, а также на защиту от предоставления сведений,
                  недостоверных или порочащих честь, достоинство и деловую
                  репутацию физического лица;
                </li>
                <li>
                  обращаться по вопросам защиты своих прав по персональным
                  данным в органы государственной власти, органы местного
                  самоуправления, к полномочиям которых относится осуществление
                  защиты персональных данных;
                </li>
                <li>
                  применять средства правовой защиты при нарушении
                  законодательства о защите персональных данных.
                </li>
              </ol>
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Порядок работы с запросами субъекта персональных данных
            (Пользователя).
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Субъект персональных данных (Пользователь) имеет право на
              получение любых сведений о себе у любого субъекта отношений,
              связанных с персональными данными, без указания цели запроса,
              кроме случаев, установленных законом.
            </li>
            <li>
              Доступ субъекта персональных данных (пользователя) к данным о себе
              осуществляется бесплатно.
            </li>
            <li>
              Субъект персональных данных (Пользователь) подает запрос о доступе
              (далее — запрос) к персональным данным владельцу персональных
              данных. <br />В запросе указываются:
              <ol className="text-sm space-y-2 list-decimal pl-8">
                <li>
                  фамилия, имя, отчество, место жительства (место пребывания) и
                  реквизиты документа, удостоверяющего личность субъекта
                  персональных данных (пользователя);
                </li>
                <li>
                  другие сведения, позволяющие идентифицировать личность
                  субъекта персональных данных (Пользователя);
                </li>
                <li>
                  сведения о персональных данных, по которым подается запрос,
                  или сведения о владельце или распорядителе;
                </li>
                <li>перечень запрашиваемых персональных данных.</li>
              </ol>
            </li>
            <li>
              Срок изучения запроса на предмет его удовлетворения не может
              превышать десяти рабочих дней со дня поступления.
            </li>
            <li>
              В течение этого срока Владелец персональных данных доводит до
              сведения субъекта персональных данных (Пользователя), что запрос
              будет удовлетворен или соответствующие персональные данные не
              подлежат предоставлению с указанием основания, определенного в
              соответствующем нормативно-правовом акте.
            </li>
            <li>
              Запрос удовлетворяется в течение тридцати календарных дней со дня
              его поступления, если иное не предусмотрено законом.
            </li>
          </ol>
        </li>

        <li>
          <p className="mb-3 font-bold text-sm">
            Внесение изменения в Положение.
          </p>
          <ol className="text-sm space-y-2 list-disc pl-4">
            <li>
              Общество может время от времени в одностороннем порядке обновлять
              это Положение без уведомления Пользователя о таких изменениях.
              Новая редакция Положения вступает в силу с момента его размещения
              на онлайн-платформе, если иное не предусмотрено новой редакцией
              Положения. Действующая редакция Положения всегда находится на
              странице по адресу:
              https://help.rozetka.com.ua/hc/uk/articles/360055893552.
            </li>
            <li>
              В случае если были внесены какие-либо изменения в Положение, с
              которыми Пользователь не согласен, он обязан прекратить
              использование Интернет-магазина. Факт продолжения использования
              Интернет-магазина является подтверждением согласия и принятия
              Пользователем редакции Положения.
            </li>
          </ol>
        </li>
      </ol>
    </div>
  );
};

export default Privacy;
