const VisaModal = () => {
  return (
    <div className="w-[35vw] p-6">
      <p>
        Платежные системы в партнерстве с банками-эмитентами внедряют
        современные схемы проверки личности держателя карты, чтобы сделать
        покупки в Интернете более безопасными. Устанавливается специальный
        пароль для каждой совершаемой операции, и это вселяет в Вас уверенность,
        что только Вы можете делать такие покупки онлайн. Современные
        технологические решения необходимы для того, чтобы держатель карты был
        уверен в безопасности транзакции и в том, что он имеет дело с настоящим
        (а не «подставным») магазином.
      </p>
      <br />
      <p>
        Одно из таких технологических решений называется Verified by Visa
        («Проверено Visa»).
      </p>
      <br />
      <p>
        Verified by Visa — это новая система защиты, которая извещает
        онлайн-торговцев, участвующих в программе, и банки о том, что Вы
        являетесь настоящим владельцем карточки, когда Вы совершаете
        онлайн-покупки. Она позволяет Вам использовать персональный пароль для
        подтверждения Вашей личности и защиты Вашей карточки Visa, когда Вы
        используете ее в Интернете, вселяя большую уверенность в совершаемых
        Вами действиях.
      </p>
      <br />
      <p>
        К технологии Verified by Visa легко подключиться, ее легко использовать,
        услуга действует для всех карточек Visa.
      </p>
      <br />
      <p>
        Для активации услуги Verified by Visa для Вашей карты необходимо
        обратиться в Ваш банк.
      </p>
    </div>
  );
};

export default VisaModal;
